Дошкольное_учреждение83/src/Documents/удуКомплектованиеГруппы/удуКомплектованиеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуКомплектованиеГруппы</name>
  <registerRecords>InformationRegister.удуСведенияОКомплекатцииГруппы</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДоговораПоУмолчанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКомплектования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьКомплектация</name>
    <attributes>
      <name>ФормироватьДоговор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденВГруппу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>CatalogRef.удуРодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаПоДоговору</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорОЗачислении</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаЗачисление</name>
      <type>
        <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерЗаявки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументыСформированы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПереходаИзДругойГруппы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФормированияДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозрастнойПризнак</name>
      <type>
        <types>CatalogRef.удуВозрастныеПризнаки</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДляЗачисления</name>
      <type>
        <types>CatalogRef.удуГруппыУчреждения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/InformationRegisters/удуСведенияОКомплекатцииГруппы/удуСведенияОКомплекатцииГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСведенияОКомплекатцииГруппы</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодКомплектования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.удуВозрастныеПризнаки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Documents/удуДоговорОЗачисленииРебенка/удуДоговорОЗачисленииРебенка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуДоговорОЗачисленииРебенка</name>
  <basedOn>Document.удуЗаявкаНаЗачислениеРебенкаВДОУ</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоЗачисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоОтчисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакФормированияБезЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОснование</name>
    <type>
      <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиОплаты</name>
    <type>
      <types>EnumRef.удуВидыСтавокРодительскойПлаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Documents/удуКомплектованиеГруппы/Forms/ФормаПросмотраУкомплектованностиГруппы/Module.bsl
&НаСервере
Процедура ОбновитьСведенияОКмплектовании()
	// Отбор по учреждению
	ТекстЗапроса = "ВЫБРАТЬ
	               |	удуСведенияОКомплекатцииГруппы.Ребенок.Ссылка КАК Ребенок,
	               |	удуСведенияОКомплекатцииГруппы.Ребенок.Пол КАК Пол,
	               |	удуСведенияОКомплекатцииГруппы.Ребенок.ДатаРождения КАК ДатаРождения,
	               |	удуСведенияОКомплекатцииГруппы.Регистратор КАК ДокументРегистратор
	               |ИЗ
	               |	РегистрСведений.удуСведенияОКомплекатцииГруппы КАК удуСведенияОКомплекатцииГруппы
	               |ГДЕ
	               |	удуСведенияОКомплекатцииГруппы.Группа = &Группа
	               |	И удуСведенияОКомплекатцииГруппы.ПериодКомплектования = &ПериодКомплектования";
				   
	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("Группа", ПараметрГруппа);
	Запрос.УстановитьПараметр("ПериодКомплектования", ПериодКомплектования);
	
	сэРезультатВыполнения = запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(сэРезультатВыполнения, "ТабличнаяЧастьДети");
КонецПроцедуры

&НаКлиенте
Процедура ПериодКомплектованияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ТекущийГод = Год(ТекущаяДата());
	
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(Формат(ТекущийГод - 1, "ЧГ=0") + "/" + Формат(ТекущийГод, "ЧГ=0"));
	СписокВыбора.Добавить(Формат(ТекущийГод, "ЧГ=0") + "/" + Формат(ТекущийГод + 1, "ЧГ=0"));
	СписокВыбора.Добавить(Формат(ТекущийГод + 1, "ЧГ=0") + "/" + Формат(ТекущийГод + 2, "ЧГ=0"));
	СписокВыбора.Добавить(Формат(ТекущийГод + 2, "ЧГ=0") + "/" + Формат(ТекущийГод + 3, "ЧГ=0"));
	СписокВыбора.Добавить(Формат(ТекущийГод + 3, "ЧГ=0") + "/" + Формат(ТекущийГод + 4, "ЧГ=0"));
	
	НайденноеЗначение = СписокВыбора.НайтиПоЗначению(Элемент.ВыделенныйТекст);
	Если НайденноеЗначение <> Неопределено Тогда
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элемент, НайденноеЗначение);
	Иначе
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элемент);
	КонецЕсли;
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ПериодКомплектования = ВыбранноеЗначение.Значение;
		ОбновитьСведенияОКмплектовании();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьДетиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ПередаваемыеПараметры = Новый Структура("Ключ", Элементы.ТекущиеДанные.ДокументРегистратор);
	ОткрытьФормуМодально("Документ.удуДоговорОЗачисленииРебенка.Форма.ФормаДокумента", ПередаваемыеПараметры, ЭтаФорма);
КонецПроцедуры
